Измеритель не переделал. 
  +Убрать привязки, 
  сделать ввод коэффициента по аналогии с остальными инструментами. 
  Сделать измеритель пометкой.
Масштабирование колесом уезжает.
Нет переключателя режима зум\пан колесом. Не получается одновременно наносить пометку и зум-панить.
Унифицировать все инструменты, задающиеся по двойному щелчку: поддержать как тычок-тычок, так и нажать-растянуть.
+ Выноска: унифицировать ввод текста по аналогии с текстом (упрать инпут)
Настраиваемая прозрачность пометок 
Пометки при масштабе на непервой странице не работают.
Запоминание поворотов и последней страницы.
Конвертация старых пометок.
Мобильный интерфейс.